src/apache-hadoop-goes-realtime-at-facebook.org
#+title: Apache Hadoop Goes Realtime at Facebook

http://borthakur.com/ftp/RealtimeHadoopSigmod2011.pdf

** ABSTRACT
** INTRODUCTION
At Facebook, Hadoop has traditionally been used in conjunction with Hive for storage and analysis of large data sets. Most of this analysis occurs in offline batch jobs and the emphasis has been on maximizing throughput and efficiency. These workloads typically read and write large amounts of data from disk sequentially. As such, there has been less emphasis on making Hadoop performant for random access workloads by providing low latency access to HDFS. （早期Hadoop只是用于离线分析，顺序读写磁盘，没有关注通过降低访问HDFS的延迟来提升随机访问的性能）Instead, we have used a combination of large clusters of MySQL databases and caching tiers built using memcached. In many cases, results from Hadoop are uploaded into MySQL or memcached for consumption by the web tier.（对于在线数据访问是将Hadoop数据upload到MySQL, 然后配合memcached来完成的）

Recently, a new generation of applications has arisen at Facebook that require very high write throughput and cheap and elastic storage, while simultaneously requiring low latency and disk efficient sequential and random read performance. MySQL storage engines are proven and have very good random read performance, but typically suffer from low random write throughput. It is difficult to scale up our MySQL clusters rapidly while maintaining good load balancing and high uptime. Administration of MySQL clusters requires a relatively high management overhead and they typically use more expensive hardware. Given our high confidence in the reliability and scalability of HDFS, we began to explore Hadoop and HBase for such applications.（MySQL的随机读性能不错，但是随机写性能非常差，同时在扩展性上也不太好。管理集群需要非常高的额外代价，并且在硬件使用方面都是高端机器）

The first set of applications requires realtime concurrent, but sequential, read access to a very large stream of realtime data being stored in HDFS. （HDFS必须支持高并发的实时读写需求）An example system generating and storing such data is Scribe , an open source distributed log aggregation service created by and used extensively at Facebook. Previously, data generated by Scribe was stored in expensive and hard to manage NFS servers.

The second generation of non-MapReduce Hadoop applications needed to dynamically index a rapidly growing data set for fast random lookups. In addition, this new application had to be suited for production use by more than 500 million people immediately after launch and needed to scale to many petabytes of data with stringent uptime requirements. We decided to use HBase for this project. HBase in turn leverages HDFS for scalable and fault tolerant storage and ZooKeeper for distributed consensus.（HBase用来存储索引并且提供实时的随机查询）

** WORKLOAD TYPES
- Facebook Messaging
  - 存储用户各种消息如email,chat,SMS等
  - High Write Throughput
  - Large Tables
  - Data Migration

- Facebook Insights
  - 实现统计分析
  - Realtime Analytics
  - High Throughput Increments

- Facebook Metrics System (ODS)
  - 指标收集监控系统
  - Automatic Sharding
  - Fast Reads of Recent Data and Table Scans

