html/apache-hadoop-goes-realtime-at-facebook.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Apache Hadoop Goes Realtime at Facebook</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">Apache Hadoop Goes Realtime at Facebook</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. ABSTRACT</a></li>
<li><a href="#sec-2">2. INTRODUCTION</a></li>
<li><a href="#sec-3">3. WORKLOAD TYPES</a></li>
<li><a href="#sec-4">4. WHY HADOOP AND HBASE</a></li>
<li><a href="#sec-5">5. REALTIME HDFS</a>
<ul>
<li><a href="#sec-5-1">5.1. High Availability - AvatarNode</a></li>
<li><a href="#sec-5-2">5.2. Hadoop RPC compatibility</a></li>
<li><a href="#sec-5-3">5.3. Block Availability: Placement Policy</a></li>
<li><a href="#sec-5-4">5.4. Performance Improvements for a Realtime Workload</a></li>
<li><a href="#sec-5-5">5.5. New Features</a></li>
</ul>
</li>
<li><a href="#sec-6">6. PRODUCTION HBASE</a>
<ul>
<li><a href="#sec-6-1">6.1. ACID Compliance</a></li>
<li><a href="#sec-6-2">6.2. Availability Improvements</a></li>
<li><a href="#sec-6-3">6.3. Performance Improvements</a></li>
</ul>
</li>
<li><a href="#sec-7">7. DEPLOYMENT AND OPERATIONAL EXPERIENCES</a>
<ul>
<li><a href="#sec-7-1">7.1. Testing</a></li>
<li><a href="#sec-7-2">7.2. Monitoring and Tools</a></li>
<li><a href="#sec-7-3">7.3. Manual versus Automatic Splitting</a></li>
<li><a href="#sec-7-4">7.4. Dark Launch</a></li>
<li><a href="#sec-7-5">7.5. Dashboards/ODS integration</a></li>
<li><a href="#sec-7-6">7.6. Backups at the Application layer</a></li>
<li><a href="#sec-7-7">7.7. Schema Changes</a></li>
<li><a href="#sec-7-8">7.8. Importing Data</a></li>
<li><a href="#sec-7-9">7.9. Reducing Network IO</a></li>
</ul>
</li>
<li><a href="#sec-8">8. FUTURE WORK</a></li>
</ul>
</div>
</div>
<p>
<a href="http://borthakur.com/ftp/RealtimeHadoopSigmod2011.pdf">http://borthakur.com/ftp/RealtimeHadoopSigmod2011.pdf</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> ABSTRACT</h2>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> INTRODUCTION</h2>
<div class="outline-text-2" id="text-2">
<p>
At Facebook, Hadoop has traditionally been used in conjunction with Hive for storage and analysis of large data sets. Most of this analysis occurs in offline batch jobs and the emphasis has been on maximizing throughput and efficiency. These workloads typically read and write large amounts of data from disk sequentially. As such, there has been less emphasis on making Hadoop performant for random access workloads by providing low latency access to HDFS. （早期Hadoop只是用于离线分析，顺序读写磁盘，没有关注通过降低访问HDFS的延迟来提升随机访问的性能）Instead, we have used a combination of large clusters of MySQL databases and caching tiers built using memcached. In many cases, results from Hadoop are uploaded into MySQL or memcached for consumption by the web tier.（对于在线数据访问是将Hadoop数据upload到MySQL, 然后配合memcached来完成的）
</p>

<p>
Recently, a new generation of applications has arisen at Facebook that require very high write throughput and cheap and elastic storage, while simultaneously requiring low latency and disk efficient sequential and random read performance. MySQL storage engines are proven and have very good random read performance, but typically suffer from low random write throughput. It is difficult to scale up our MySQL clusters rapidly while maintaining good load balancing and high uptime. Administration of MySQL clusters requires a relatively high management overhead and they typically use more expensive hardware. Given our high confidence in the reliability and scalability of HDFS, we began to explore Hadoop and HBase for such applications.（MySQL的随机读性能不错，但是随机写性能非常差，同时在扩展性上也不太好。管理集群需要非常高的额外代价，并且在硬件使用方面都是高端机器）
</p>

<p>
The first set of applications requires realtime concurrent, but sequential, read access to a very large stream of realtime data being stored in HDFS. （HDFS必须支持高并发的实时读写需求）An example system generating and storing such data is Scribe , an open source distributed log aggregation service created by and used extensively at Facebook. Previously, data generated by Scribe was stored in expensive and hard to manage NFS servers.
</p>

<p>
The second generation of non-MapReduce Hadoop applications needed to dynamically index a rapidly growing data set for fast random lookups. In addition, this new application had to be suited for production use by more than 500 million people immediately after launch and needed to scale to many petabytes of data with stringent uptime requirements. We decided to use HBase for this project. HBase in turn leverages HDFS for scalable and fault tolerant storage and ZooKeeper for distributed consensus.（HBase用来存储索引并且提供实时的随机查询）
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> WORKLOAD TYPES</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Facebook Messaging
<ul class="org-ul">
<li>存储用户各种消息如email,chat,SMS等
</li>
<li>High Write Throughput
</li>
<li>Large Tables
</li>
<li>Data Migration
</li>
</ul>
</li>

<li>Facebook Insights
<ul class="org-ul">
<li>实现统计分析
</li>
<li>Realtime Analytics
</li>
<li>High Throughput Increments
</li>
</ul>
</li>

<li>Facebook Metrics System (ODS)
<ul class="org-ul">
<li>指标收集监控系统
</li>
<li>Automatic Sharding
</li>
<li>Fast Reads of Recent Data and Table Scans
</li>
</ul>
</li>
</ul>
</div>
</div>
