src/apache-hadoop-goes-realtime-at-facebook.org
** WHY HADOOP AND HBASE
The requirements for the storage  system  from  the  workloads presented above can be summarized  as follows (in no particular order):
1. Elasticity: We need to be able to add incremental capacity to our storage systems with minimal overhead and no downtime. In some cases we may want to add capacity rapidly and the system should automatically balance load and utilization across new hardware.  （扩展性好）
2. High write throughput: Most of the applications store (and optionally index) tremendous amounts of data and require high aggregate write throughput.（高吞吐写入）
3. Efficient and low-latency strong consistency semantics within a data center. While a globally distributed strongly consistent system is practically impossible, a system that could at least provide strong consistency within a data center would make it possible to provide a good user experience.（单机房里高效并且低延迟地达到强一致性）
4. Efficient random reads from disk:  In spite of the widespread use of application level caches (whether embedded or via memcached), at   Facebook scale, a lot of accesses miss the cache and hit the back-end storage system. MySQL is very efficient at performing random reads from disk and any new system would have to be comparable.（磁盘随机读需要高效）
5. High Availability and Disaster Recovery:  We need to provide a service with very high uptime to users that covers both planned and unplanned events  (examples of the former being events like software upgrades and addition of hardware/capacity and the latter exemplified by failures of hardware components). We also need to be able to tolerate the loss of a data center with minimal data loss and be able to serve data out of another data center in a reasonable time frame.（高可用性以及容灾）
6. Fault Isolation: Our long experience running large farms of MySQL databases has shown us that fault isolation is critical. Individual databases can and do  go  down,  but  only  a  small fraction of users are affected by any such event. Similarly, in our warehouse usage of Hadoop, individual disk failures affect only a small part of the data and the system quickly recovers from such faults.（错误隔离。即使出现问题的话只是部分数据受到影响，而其他数据依然可以正常访问和读写）
7. Atomic read-modify-write primitives:  Atomic increments and compare-and-swap APIs have been very useful in building lockless concurrent applications  and are a must have from the underlying storage system（这个可能对于计数是有用的）
8. Range Scans: Several applications require efficient retrieval of a set of rows in a particular range. For example all the last 100 messages for a given user or the hourly impression counts over the last 24 hours for a given advertiser.（范围扫描比如需要知道最后100条消息的时候可能有用）

It is also worth pointing out non-requirements:
1. Tolerance of network partitions within a single data center:  Different system components are often inherently centralized. For example, MySQL servers may all be located within a few racks, and network  partitions within a data center would cause major loss in serving capabilities therein. Hence every effort is made to eliminate the possibility of such events at the hardware level by having a highly redundant network design.（网络分割性的话通过在硬件层面解决比如使用高冗余的网络设计）
2. Zero Downtime in case of individual data center failure: In our experience such failures are very rare, though not impossible. In a less than ideal world where the choice of system design boils down to the choice of compromises that are acceptable, this is one compromise that we are willing to make given the low occurrence rate of such events
3. Active-active serving capability across different data centers: As mentioned before, we were comfortable making the assumption that user data could be federated across different data centers (based ideally on user locality). Latency (when user and data locality did not match up) could be masked by using an application cache close to the user.

** REALTIME HDFS
*** High Availability - AvatarNode
NN hot standby.
- fsimage的editlog通过NFS传递
- 多个avatar node之间通过zookeeper选举primary node,
- dn会向多个avatar node做block report.

*** Hadoop RPC compatibility
在RPC层面上兼容多个Hadoop版本存在

*** Block Availability: Placement Policy
- The default HDFS block placement policy, while rack aware, is still minimally constrained. Placement decision for non-local replicas is random, it can be on any rack and within any node of the rack.
- To reduce the probability of data loss when multiple simultaneous nodes fail, we implemented a pluggable block placement policy that constrains the placement of block replicas into smaller, configurable node groups.（编写可插拔的策略. 将node进行分组来决定replicas放置位置） This allows us to reduce the probability of data loss by orders of magnitude, depending on the size chosen for the groups.
- Our strategy is to define a window of racks and machines where replicas can be placed around the original block, using a logical ring of racks, each one containing a logical ring of machines. More details, the math, and the scripts used to calculate these numbers can be found at HDFS-1094. （这个策略我推断是这样的，首先将所有的rack做编号，然后每个rack内部的machine做编号。然后根据original block的位置，1th replica位置应该是在相同的rack但是不同的机器，这个机器和这个original block距离是某个windows size. 同理rack如此）
- We found that the probability of losing a random block increases with the size of the node group. In our clusters, we started to use a node group of (2, 5), i.e. a rack window size of 2 and a machine window size of 5. We picked this choice because the probability of data loss is about a hundred times lesser than the default block placement policy.

