html/apache-hadoop-goes-realtime-at-facebook.html

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Performance Improvements for a Realtime Workload</h3>
<div class="outline-text-3" id="text-5-4">
<p>
HDFS is originally designed for high-throughput systems like MapReduce. <b>Many of its original design principles are to improve its throughput but do not focus much on response time.</b> For example, when dealing with errors, it favors retries or wait over fast failures. To support realtime applications, offering reasonable response time even in case of errors becomes the major challenge for HDFS.
</p>

<p>
RPC Timeout
</p>
<ul class="org-ul">
<li>When a RPC client detects a tcp-socket timeout, instead of declaring a RPC timeout, it sends a ping to the RPC server. If the server is still alive, the client continues to wait for a response. （原有RPC实现是检测发生超时的话那么会发送一个ping检查RPC server是否存在，如果存在的话，那么依然会等待响应结果）
<ul class="org-ul">
<li>The idea is that if a RPC server is experiencing a communication burst, a temporary high load, or a stop the world GC, the client should wait and throttles its traffic to the server. （这是因为考虑到dn可能有高峰的负载或者是GC，所以client会等待并且自动调节和server的流量）
</li>
<li>On the contrary, throwing a timeout exception or retrying the RPC request causes tasks to fail unnecessarily or add additional load to a RPC server.  （相反如果立即返回exception或者是重试的话，那么可能造成task不必要地失败，或者是对RPC server造成更大的负担）
</li>
</ul>
</li>
<li>However, infinite wait adversely impacts any application that has a real time requirement. An HDFS client occasionally makes an RPC to some Dataode, and it is bad when the DataNode fails to respond back in time and the client is stuck in an RPC. （但是上面的策略会导致client stuck在某个RPC上，这对于实时系统是不可以接收的）
<ul class="org-ul">
<li>A better strategy is to fail fast and try a different DataNode for either reading or writing. （一个比较好的解决办法就是如果发现超时的话那么更换一台dn机器进行尝试）
</li>
<li>Hence, we added the ability for specifying an RPC-timeout when starting a RPC session with a server.
</li>
</ul>
</li>
</ul>

<p>
Recover File Lease
</p>
<ul class="org-ul">
<li>Another enhancement is to revoke a writer‘s lease quickly. 加快回收writer的租赁时间
<ul class="org-ul">
<li>HDFS supports only a single writer to a file and the NameNode maintains leases to enforce this semantic. （HDFS只允许每个文件一个writer）
</li>
<li>There are many cases when an application wants to open a file to read but it was not closed cleanly earlier.（但是如果之前的writer没有正确清理而这个时候有reader的话，那么reader就需要等待这个writer尽快释放其lease)
</li>
<li>Previously this was done by repetitively calling HDFS-append on the log file until the call succeeds. The append operations triggers a file’s soft lease to expire. So the application had to wait for a minimum of the soft lease period (with a default value of one minute) before the HDFS name node revokes the log file‘s lease.（开始是不断调用append来出发soft lease失效，但是失效也需要等待一段时间）
</li>
<li>Secondly, the HDFS-append operation has additional unneeded  cost as establishing a write pipeline usually involves more than one DataNode. When an error occurs, a pipeline establishment might take up to 10 minutes. （而append本身也是存在不必要的开销需要建立write pipeline）
</li>
</ul>
</li>
<li>To avoid the HDFS-append  overhead,  we  added  a  lightweight HDFS API called  recoverLease  that  revokes  a  file’s  lease explicitly. （增加API以及对应的语义来加快lease的失效和回收）
<ul class="org-ul">
<li>When the NameNode receives a recoverLease request, it immediately changes the fileBs lease holder to be itself. It then starts the lease recovery process.
</li>
<li>The recoverLease rpc returns the status whether the lease recovery was complete. The application waits for a success return code from  recoverLease  before attempting to read from the file.
</li>
</ul>
</li>
</ul>

<p>
Reads from Local Replicas
</p>
<ul class="org-ul">
<li>There are times when an application wants to store data in HDFS for scalability and performance reasons. However, the latency of reads and writes to an HDFS file is an order of magnitude greater than reading or writing to a local file on the machine.
</li>
<li>To alleviate this problem, we implemented  an enhancement to the HDFS client that detects that there is a local replica of the data and then transparently reads data from the local replica without transferring the data via the DataNode. This has resulted in  doubling the performance profile of a certain workload that uses HBase.（如果发现本地有对应hdfs block的话那么直接从本地进行读取，而在走dn这层）
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> New Features</h3>
<div class="outline-text-3" id="text-5-5">
<p>
HDFS sync
</p>
<ul class="org-ul">
<li>Hflush/sync is an important operation for both HBase and Scribe. It pushes the written data buffered at the client side to the write pipeline, making the data visible to any new reader and increasing the data durability when either the client or any DataNode on the pipeline fails.（调用hflush/sync之后，之前所写的内容应该是全部都到了dn disk上面，能够被所有的reader读取到） #todo: 对hflush/sync这个语义至今比较模糊，一个比较主要的原因就是这个API历史上是调整过语义的
</li>
<li>Hflush/sync is  a synchronous operation, meaning that it does not return until an acknowledgement from the write pipeline is received. Since the operation is frequently invoked, increasing its efficiency is important.（但是这个过程是同步的）
</li>
<li>One optimization we have is to allow following writes to proceed while an Hflush/sync operation is waiting for a reply. This greatly increases the write throughput in both HBase and Scribe where a designated thread invokes Hflush/sync periodically.（一个优化就是在write的同时调用hflush/sync并且等待返回，这样可以增加写入的吞吐）
</li>
</ul>

<p>
Concurrent Readers
</p>
<ul class="org-ul">
<li>We have an application that requires the ability to read a file while it is being written to. The reader first talks to the NameNode to get the meta information of the file. Since the NameNode does not have the most updated information of its last block‘s length, the client fetches the information from one of the DataNodes where one of its replicas resides. It then starts to read the file.
</li>
<li>The challenge of concurrent readers and writer is how to provision the last chunk of data when its data content and checksum are dynamically changing. We solve the problem by recomputing the checksum of the last chunk of data on demand.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> PRODUCTION HBASE</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> ACID Compliance</h3>
</div>
