html/apache-hadoop-goes-realtime-at-facebook.html

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Monitoring and Tools</h3>
<div class="outline-text-3" id="text-7-2">
<p>
As we gained more experience with production usage of HBase, it became clear that our primary problem was in consistent assignment of regions to RegionServers. Two RegionServers could end up serving the same region, or a region may be left unassigned.（region assignement不一致，会造成某个region被两个rs共同管理，或者是某个region没有rs来管理）
</p>
<ul class="org-ul">
<li>These problems are characterized by inconsistencies in metadata about the state of the regions that are stored in different places: the META region in HBase, ZooKeeper, files corresponding to a region in HDFS and the in-memory state of the RegionServers.
</li>
<li>To that end, we created HBCK as a database-level FSCK utility to verify the consistency between these different sources  of  metadata.  For  the  common inconsistencies, we added an HBCK ifixB option to clear the inmemory state and have the HMaster reassign the inconsistent region. Nowadays we run HBCK almost continuously against our production clusters to catch problems as early as possible.
</li>
</ul>

<p>
A critical component for cluster monitoring is operational metrics. In particular, RegionServer metrics are far more useful for evaluating the health of the cluster than HMaster or ZooKeeper metrcs. HBase already had a number of metrics exported through JMX. However, all the metrics were for short-running operations such as log writes and RPC requests. We needed to add metrics to monitor long-running events such as compactions, flushes, and log splits. A slightly innocuous metric that ended up being critical for monitoring was version information. We have multiple clusters that often have divergent versions.（版本是比较重要的监控信息，因为每个版本功能是不同的，而整个集群里面可能会存在很多不同的版本）
</p>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Manual versus Automatic Splitting</h3>
<div class="outline-text-3" id="text-7-3">
<p>
manual splitting over automatic splitting是有一定前提假设的，不过确实带来了许多可控方面的好处
</p>

<p>
Since our data grows roughly uniform across all regions, it's easy for automatic splitting to cause split and compaction storms as the regions all roughly hit the same data size at the same time. With manual splits, we can stagger splits across time and thereby spread out the network IO load typically generated by the splitting process. This minimizes impact to production workload.
</p>

<p>
Since the number of regions is known at any given point in time, long-term debugging and profiling is much easier. It is hard to trace the logs to understand region level problems if regions keep splitting and getting renamed.
</p>
</div>
</div>

<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> Dark Launch</h3>
<div class="outline-text-3" id="text-7-4">
<p>
Migrating from a legacy messaging system offered one major advantage: real-world testing capability. At Facebook, we widely use a testing/rollout process called "Dark Launch" where critical back-end functionality is exercised by a subset of the user base without exposing any UI changes to them. We used this facility to double-write messaging traffic for some users to both the legacy infrastructure and HBase.（将一部分用户请求重写一份到新的集群上面）
</p>
<ul class="org-ul">
<li>This allowed us to do useful performance benchmarks and find  practical  HBase  bottlenecks instead of relying purely on artificial benchmarks and estimations. （使用真实流量测试性能）
</li>
<li>Even after product launch, we still found many uses for Dark Launch clusters. All code changes normally spend a week running on Dark Launch before a production push is considered. （正式发布是在暗启动正常工作1周后上线）
</li>
<li>Additionally, Dark Launch normally handles at least 2x the load that we expect our production clusters to handle. Long term testing at 2x load allows us to weather multiple traffic spikes and verify that HBase can handle outlier peak conditions before we vertically scale.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> Dashboards/ODS integration</h3>
</div>
<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> Backups at the Application layer</h3>
</div>
<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> Schema Changes</h3>
</div>
<div id="outline-container-sec-7-8" class="outline-3">
<h3 id="sec-7-8"><span class="section-number-3">7.8</span> Importing Data</h3>
</div>
<div id="outline-container-sec-7-9" class="outline-3">
<h3 id="sec-7-9"><span class="section-number-3">7.9</span> Reducing Network IO</h3>
<div class="outline-text-3" id="text-7-9">
<p>
After running in production for a couple months, we quickly realized from our dashboards that we were network IO bound. We needed some way to analyze where our network IO traffic was coming from.
</p>

<p>
We utilized a combination of JMX statistics and log scraping to estimate total network IO on a single RegionServer for a 24-hour period. We broke down the network traffic across the MemStore flush (15%), size-based minor compactions (38%), and time-based major compactions (47%).（通过JMX来观察网路流量的开销来进行优化） We found a lot of lowhanging optimizations by observing these ratios.
</p>
<ul class="org-ul">
<li>We were able to get 40% network IO reduction by simply increasing our major compaction interval from every day to every week.
</li>
<li>We also got big gains by excluding certain column families from being logged to the HLog. Best effort durability sufficed for data stored in these column families
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> FUTURE WORK</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>adding support for maintenance of secondary indices and summary views in HBase. In many use cases, such derived data and views can be maintained asynchronously （维护二级索引以及摘要等信息，这些信息通常都是可以异步维护的）
</li>
<li>Many use cases benefit from storing a large amount of data in HBaseBs cache and improvements to HBase are required to exploit very large physical memory. The current limitations in this area arise from issues with using an extremely large heap in Java and we are evaluating several proposals like writing a slab allocator in Java or managing memory via JNI（使用JNI来改写slab allocator)
</li>
<li>A related topic  is exploiting flash memory to extend the HBase cache and we are exploring various ways to utilize it including <a href="https://github.com/facebook/flashcache%20">FlashCache</a>
</li>
<li>Finally, as we try to use Hadoop and HBase for applications that are built to serve the same data in an active-active manner across different data centers, we are exploring approaches to deal with multi data-center replication and conflict resolution（多机房部署使用以及冲突处理）
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
